I-SYST/EHAL/ARM/Nordic/src/uart_nrf5x.cpp
/**-------------------------------------------------------------------------
@file	uart_nrf5x.c

@brief	nRF5x UART implementation

@author	Hoang Nguyen Hoan
@date	Aug. 30, 2015

@license

Copyright (c) 2015, I-SYST, all rights reserved

Permission to use, copy, modify, and distribute this software for any purpose
with or without fee is hereby granted, provided that the above copyright
notice and this permission notice appear in all copies, and none of the
names : I-SYST, I-SYST inc. or its contributors may be used to endorse or
promote products derived from this software without specific prior written
permission.

For info or contributing contact : hnhoan at i-syst dot com

THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND ANY
EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY
DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

----------------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include <stdint.h>
#include <stdarg.h>

#include "nrf.h"

#include "istddef.h"
#include "iopinctrl.h"
#include "coredev/uart.h"
#include "idelay.h"
#include "atomic.h"

#define NRF5X_UART_HWFIFO_SIZE		6
#define NRF5X_UART_RXTIMEOUT		15
#define NRF5X_UART_BUFF_SIZE		16

#ifdef NRF52840_XXAA
#define NRF52_UART_DMA_MAX_LEN		65535
#else
#define NRF52_UART_DMA_MAX_LEN		255
#endif

#define NRF5X_UART_CFIFO_SIZE		CFIFO_MEMSIZE(NRF5X_UART_BUFF_SIZE)

#pragma pack(push, 4)
// Device driver data require by low level functions
typedef struct _nRF_UART_Dev {
	int DevNo;				// UART interface number
	union {
		NRF_UART_Type *pReg;		// UART registers
#ifndef NRF51
		NRF_UARTE_Type *pDmaReg;	// UART registers
#endif
	};
	UARTDEV	*pUartDev;				// Pointer to generic UART dev. data
	uint32_t RxDropCnt;
	uint32_t RxTimeoutCnt;
	uint32_t TxDropCnt;
	uint32_t ErrCnt;
//	volatile bool bRxReady;
//	volatile bool bTxReady;
	uint32_t RxPin;
	uint32_t TxPin;
	uint32_t CtsPin;
	uint32_t RtsPin;
	uint8_t TxDmaCache[NRF5X_UART_BUFF_SIZE];
	uint8_t RxFifoMem[NRF5X_UART_CFIFO_SIZE];
	uint8_t TxFifoMem[NRF5X_UART_CFIFO_SIZE];
} NRF5X_UARTDEV;

typedef struct {
	int Baud;
	int nRFBaud;
} NRFRATECVT;

#pragma pack(pop)

const NRFRATECVT s_BaudnRF[] = {
	{1200, UART_BAUDRATE_BAUDRATE_Baud1200},
	{2400, UART_BAUDRATE_BAUDRATE_Baud2400},
	{4800, UART_BAUDRATE_BAUDRATE_Baud4800},
	{9600, UART_BAUDRATE_BAUDRATE_Baud9600},
	{14400, UART_BAUDRATE_BAUDRATE_Baud14400},
	{19200, UART_BAUDRATE_BAUDRATE_Baud19200},
	{28800, UART_BAUDRATE_BAUDRATE_Baud28800},
	{38400, UART_BAUDRATE_BAUDRATE_Baud38400},
	{57600, UART_BAUDRATE_BAUDRATE_Baud57600},
	{76800, UART_BAUDRATE_BAUDRATE_Baud76800},
	{115200, UART_BAUDRATE_BAUDRATE_Baud115200},
	{230400, UART_BAUDRATE_BAUDRATE_Baud230400},
	{250000, UART_BAUDRATE_BAUDRATE_Baud250000},
	{460800, UART_BAUDRATE_BAUDRATE_Baud460800},
	{921600, UART_BAUDRATE_BAUDRATE_Baud921600},
	{1000000, UART_BAUDRATE_BAUDRATE_Baud1M}
};

static const int s_NbBaudnRF = sizeof(s_BaudnRF) / sizeof(NRFRATECVT);

static NRF5X_UARTDEV s_nRFUartDev[] = {
	{
		0,
		{ .pReg = NRF_UART0, },
		NULL,
		0, 0, 0,
		false,
		true,
	},
#ifdef NRF52840_XXAA
	{
		1,
		{ .pDmaReg = NRF_UARTE1, },
		NULL,
		0, 0, 0,
		false,
		true,
	},
#endif
};

static const int s_NbUartDev = sizeof(s_nRFUartDev) / sizeof(NRF5X_UARTDEV);

bool nRFUARTWaitForRxReady(NRF5X_UARTDEV * const pDev, uint32_t Timeout)
{
	do {
		if (pDev->pReg->EVENTS_RXDRDY || pDev->pUartDev->bRxReady)
		{
//			pDev->pReg->EVENTS_RXDRDY = 0;
//			pDev->pReg->EVENTS_RXTO = 0;
			return true;
		}
	} while (Timeout-- > 0);

	return false;
}

bool nRFUARTWaitForTxReady(NRF5X_UARTDEV * const pDev, uint32_t Timeout)
{
	do {
		if (pDev->pReg->EVENTS_TXDRDY || pDev->pUartDev->bTxReady == true)
		{
			//pDev->pReg->EVENTS_TXDRDY = 0;
			//pDev->bTxReady = true;
			return true;
		}
	} while (Timeout-- > 0);

	return false;
}

static void UART_IRQHandler(NRF5X_UARTDEV * const pDev)
{
	//uint8_t buff[NRFUART_CFIFO_SIZE];
	int len = 0;
	int cnt = 0;
#ifdef NRF52_SERIES
	uint8_t rxto = pDev->pUartDev->DevIntrf.bDma == true ? pDev->pDmaReg->EVENTS_RXTO : pDev->pReg->EVENTS_RXTO;

	if (rxto && pDev->pUartDev->DevIntrf.bDma == true)
	{
		pDev->RxTimeoutCnt++;
		pDev->pDmaReg->TASKS_FLUSHRX = 1;
		pDev->pDmaReg->EVENTS_RXTO = 0;
	}
#else
	uint8_t rxto = pDev->pReg->EVENTS_RXTO;
#endif

	if (pDev->pReg->EVENTS_RXDRDY || rxto)
	{
		//s_nRF51RxTimeOutCnt = 0;
		uint8_t *d;

		cnt = 0;
		do {
			pDev->pReg->EVENTS_RXDRDY = 0;
			pDev->pUartDev->bRxReady = false;

			d = CFifoPut(pDev->pUartDev->hRxFifo);
			if (d == NULL)
			{
				pDev->pUartDev->bRxReady = true;
				pDev->RxDropCnt++;// g_nRF51RxDropCnt++;
				break;
			}
			*d = pDev->pReg->RXD;
			cnt++;
		} while (pDev->pReg->EVENTS_RXDRDY && cnt < NRF5X_UART_HWFIFO_SIZE) ;

		if (pDev->pUartDev->EvtCallback)
		{
			len = CFifoUsed(pDev->pUartDev->hRxFifo);
			if (pDev->pReg->EVENTS_RXTO)
			{
				pDev->pReg->EVENTS_RXTO = 0;
				pDev->pUartDev->bRxReady = false;
				cnt = pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_RXTIMEOUT, NULL, len);
			}
			else
				cnt = pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_RXDATA, NULL, len);
		}
	}

#ifdef NRF52_SERIES
	if (pDev->pDmaReg->EVENTS_ENDRX)
	{
		// No DMA support for RX, just clear the event
		pDev->pDmaReg->EVENTS_ENDRX = 0;
#if 0
		int cnt = pDev->pDmaReg->RXD.AMOUNT;
		uint8_t *pcache = pDev->RxDmaCache;

		while (cnt > 0)
		{
			int l = cnt;
			uint8_t *p = CFifoPutMultiple(pDev->pUartDev->hRxFifo, &l);
			if (p == NULL)
			{
				break;
			}

