I-SYST/EHAL/ARM/Nordic/src/uart_nrf5x.cpp
			memcpy(p, pcache, l);
			pcache += l;
			cnt -= l;
		}

		if (cnt > 0)
		{
			memcpy(pDev->RxDmaCache, pcache, cnt);
		}
		pDev->bRxReady = false;
		pDev->pDmaReg->RXD.MAXCNT = NRF5X_UART_BUFF_SIZE - cnt;
		pDev->pDmaReg->RXD.PTR = (uint32_t)&pDev->RxDmaCache[cnt];
		pDev->pDmaReg->TASKS_STARTRX = 1;

		if (pDev->pUartDev->EvtCallback)
		{
			len = CFifoUsed(pDev->pUartDev->hRxFifo);
			if (pDev->pReg->EVENTS_RXTO)
			{
				pDev->pReg->EVENTS_RXTO = 0;
				pDev->bRxReady = false;
				cnt = pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_RXTIMEOUT, NULL, len);
			}
			else
				cnt = pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_RXDATA, NULL, len);
		}
#endif
	}
#endif

	if (pDev->pReg->EVENTS_TXDRDY)
	{

		pDev->pReg->EVENTS_TXDRDY = 0;
		cnt = 0;

#ifdef NRF52_SERIES
		if (pDev->pUartDev->DevIntrf.bDma == false)
#endif
		{
			do {
				pDev->pReg->EVENTS_TXDRDY = 0;

				uint8_t *p = CFifoGet(pDev->pUartDev->hTxFifo);
				if (p == NULL)
				{
					pDev->pUartDev->bTxReady = true;
					break;
				}
				pDev->pUartDev->bTxReady = false;
				pDev->pReg->TXD = *p;
				cnt++;
			} while (pDev->pReg->EVENTS_TXDRDY && cnt < NRF5X_UART_HWFIFO_SIZE);

			if (pDev->pUartDev->EvtCallback)
			{
				//uint8_t buff[NRFUART_CFIFO_SIZE];

				//len = min(NRFUART_CFIFO_SIZE, CFifoAvail(s_nRFUartDev.pUartDev->hTxFifo));
				len = CFifoAvail(pDev->pUartDev->hTxFifo);
				len = pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_TXREADY, NULL, len);
				if (len > 0)
				{
					//s_nRFUartDev.bTxReady = false;
					//nRFUARTTxData(&s_nRFUartDev.pUartDev->SerIntrf, buff, len);
				}
			}
		}
	}

#ifdef NRF52_SERIES
	if (pDev->pDmaReg->EVENTS_ENDTX || pDev->pDmaReg->EVENTS_TXSTOPPED)
	{
		pDev->pDmaReg->EVENTS_ENDTX = 0;
		pDev->pDmaReg->EVENTS_TXSTOPPED = 0;

		int l = NRF5X_UART_BUFF_SIZE;//min(CFifoUsed(pDev->pUartDev->hTxFifo), NRF52_UART_DMA_MAX_LEN);
		uint8_t *p = CFifoGetMultiple(pDev->pUartDev->hTxFifo, &l);
		if (p)
		{
			pDev->pUartDev->bTxReady = false;

			// Transfer to tx cache before sending as CFifo will immediately make the memory
			// block available for reuse in the Put request. This could cause an overwrite
			// if uart tx has not completed in time.
			memcpy(&pDev->TxDmaCache, p, l);

			pDev->pDmaReg->TXD.MAXCNT = l;
			pDev->pDmaReg->TXD.PTR = (uint32_t)pDev->TxDmaCache;
			pDev->pDmaReg->TASKS_STARTTX = 1;
		}
		else
		{
			pDev->pUartDev->bTxReady = true;
		}
		if (pDev->pUartDev->EvtCallback)
		{
			//uint8_t buff[NRFUART_CFIFO_SIZE];

			//len = min(NRFUART_CFIFO_SIZE, CFifoAvail(s_nRFUartDev.pUartDev->hTxFifo));
			len = CFifoAvail(pDev->pUartDev->hTxFifo);
			len = pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_TXREADY, NULL, len);
			if (len > 0)
			{
				//s_nRFUartDev.bTxReady = false;
				//nRFUARTTxData(&s_nRFUartDev.pUartDev->SerIntrf, buff, len);
			}
		}
	}
#endif

	if (pDev->pReg->EVENTS_ERROR)
	{
		pDev->pReg->EVENTS_ERROR = 0;
		if (pDev->pReg->ERRORSRC & 1)	// Overrrun
		{
			pDev->ErrCnt++;//g_nRF51RxErrCnt++;
			len = 0;
			cnt = 0;
			//int l = 0;
			uint8_t *d;
			do {
				pDev->pReg->EVENTS_RXDRDY = 0;
				d = CFifoPut(pDev->pUartDev->hRxFifo);
				if (d == NULL)
				{
					pDev->pUartDev->bRxReady = true;
					break;
				}
				pDev->pUartDev->bRxReady = false;
				*d = pDev->pReg->RXD;
				cnt++;
			} while (pDev->pReg->EVENTS_RXDRDY && cnt < NRF5X_UART_HWFIFO_SIZE);

			if (pDev->pUartDev->EvtCallback)
			{
				len = CFifoUsed(pDev->pUartDev->hRxFifo);
				pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_RXDATA, NULL, len);
			}
		}
		pDev->pReg->ERRORSRC = pDev->pReg->ERRORSRC;
		len = 0;
		if (pDev->pUartDev->EvtCallback)
		{
			pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_LINESTATE, NULL, len);
		}
		pDev->pReg->TASKS_STARTRX = 1;
	}

	if (pDev->pReg->EVENTS_CTS)
	{
		pDev->pReg->EVENTS_CTS = 0;
		pDev->pUartDev->LineState &= ~UART_LINESTATE_CTS;
        if (pDev->pUartDev->EvtCallback)
        {
            uint8_t buff = 0;//UART_LINESTATE_CTS;
    //        buff[1] = 0;//UART_LINESTATE_CTS;
            len = 1;
            pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_LINESTATE, &buff, len);
        }
		//NRF_UART0->TASKS_STARTTX = 1;
		//s_nRFUartDev.bTxReady = true;
	}

	if (pDev->pReg->EVENTS_NCTS)
	{
		pDev->pReg->EVENTS_NCTS = 0;
		pDev->pUartDev->LineState |= UART_LINESTATE_CTS;
		//NRF_UART0->TASKS_STOPTX = 1;
        if (pDev->pUartDev->EvtCallback)
        {
            uint8_t buff = UART_LINESTATE_CTS;
//            buff[1] = UART_LINESTATE_CTS;
            len = 1;
            pDev->pUartDev->EvtCallback(pDev->pUartDev, UART_EVT_LINESTATE, &buff, len);
        }
	}
}

extern "C" void UART0_IRQHandler()
{
	UART_IRQHandler(&s_nRFUartDev[0]);
}

#ifdef NRF52840_XXAA
extern "C" void UARTE1_IRQHandler()
{
	UART_IRQHandler(&s_nRFUartDev[1]);
}
#endif

static inline int nRFUARTGetRate(DEVINTRF * const pDev) {
	return ((NRF5X_UARTDEV*)pDev->pDevData)->pUartDev->Rate;
}

static int nRFUARTSetRate(DEVINTRF * const pDev, int Rate)
{
	NRF5X_UARTDEV *dev = (NRF5X_UARTDEV *)pDev->pDevData;

	int rate = s_BaudnRF[s_NbBaudnRF].Baud;

	for (int i = 0; i < s_NbBaudnRF; i++)
	{
		if (s_BaudnRF[i].Baud >= Rate)
		{
		    dev->pReg->BAUDRATE = (s_BaudnRF[i].nRFBaud << UART_BAUDRATE_BAUDRATE_Pos);

		    rate = s_BaudnRF[i].Baud;
		    break;
		}
	}

	return rate;
}

static inline bool nRFUARTStartRx(DEVINTRF * const pSerDev, int DevAddr) {
	return true;
}

static int nRFUARTRxData(DEVINTRF * const pDev, uint8_t *pBuff, int Bufflen)
{
	NRF5X_UARTDEV *dev = (NRF5X_UARTDEV *)pDev->pDevData;
	int cnt = 0;

	uint32_t state = DisableInterrupt();
	while (Bufflen)
	{
		int l  = Bufflen;
		uint8_t *p = CFifoGetMultiple(dev->pUartDev->hRxFifo, &l);
		if (p == NULL)
			break;
		memcpy(pBuff, p, l);
		cnt += l;
		pBuff += l;
		Bufflen -= l;
	}
	EnableInterrupt(state);

	if (dev->pUartDev->bRxReady)
	{
		uint8_t *p = CFifoPut(dev->pUartDev->hRxFifo);
		if (p)
		{
			dev->pReg->EVENTS_RXDRDY = 0;
			dev->pUartDev->bRxReady = false;
			*p = dev->pReg->RXD;
		}
	}

	return cnt;
}

static inline void nRFUARTStopRx(DEVINTRF * const pDev) {
}

static inline bool nRFUARTStartTx(DEVINTRF * const pDev, int DevAddr) {
	return true;
}

static int nRFUARTTxData(DEVINTRF * const pDev, uint8_t *pData, int Datalen)
{
	NRF5X_UARTDEV *dev = (NRF5X_UARTDEV *)pDev->pDevData;
    int cnt = 0;
    int rtry = pDev->MaxRetry;

